ChibiOS/ChibiOS/os/hal/ports/STM32/STM32H5xx/hal_lld.h
#define STM32_PLL3SRC_MASK       (3 << 0)
#define STM32_PLL3SRC_FIELD(n)   ((n) << 0)
#define STM32_PLL3SRC_NOCLOCK    STM32_PLL3SRC_FIELD(0U)
#define STM32_PLL3SRC_HSI        STM32_PLL3SRC_FIELD(1U)
#define STM32_PLL3SRC_CSI        STM32_PLL3SRC_FIELD(2U)
#define STM32_PLL3SRC_HSE        STM32_PLL3SRC_FIELD(3U)
/** @} */

/**
 * @name    RCC_CCIPR1 register bits definitions
 * @{
 */
#define STM32_USART1SEL_MASK    (7U << 0)
#define STM32_USART1SEL_FIELD(n) ((n) << 0)
#define STM32_USART1SEL_PCLK2   STM32_USART1SEL_FIELD(0U)
#define STM32_USART1SEL_PLL2Q   STM32_USART1SEL_FIELD(1U)
#define STM32_USART1SEL_PLL3Q   STM32_USART1SEL_FIELD(2U)
#define STM32_USART1SEL_HSI     STM32_USART1SEL_FIELD(3U)
#define STM32_USART1SEL_CSI     STM32_USART1SEL_FIELD(4U)
#define STM32_USART1SEL_LSE     STM32_USART1SEL_FIELD(5U)

#define STM32_USART2SEL_MASK    (7U << 3)
#define STM32_USART2SEL_FIELD(n) ((n) << 3)
#define STM32_USART2SEL_PCLK1   STM32_USART2SEL_FIELD(0U)
#define STM32_USART2SEL_PLL2Q   STM32_USART2SEL_FIELD(1U)
#define STM32_USART2SEL_PLL3Q   STM32_USART2SEL_FIELD(2U)
#define STM32_USART2SEL_HSI     STM32_USART2SEL_FIELD(3U)
#define STM32_USART2SEL_CSI     STM32_USART2SEL_FIELD(4U)
#define STM32_USART2SEL_LSE     STM32_USART2SEL_FIELD(5U)

#define STM32_USART3SEL_MASK    (7U << 6)
#define STM32_USART3SEL_FIELD(n) ((n) << 6)
#define STM32_USART3SEL_PCLK1   STM32_USART3SEL_FIELD(0U)
#define STM32_USART3SEL_PLL2Q   STM32_USART3SEL_FIELD(1U)
#define STM32_USART3SEL_PLL3Q   STM32_USART3SEL_FIELD(2U)
#define STM32_USART3SEL_HSI     STM32_USART3SEL_FIELD(3U)
#define STM32_USART3SEL_CSI     STM32_USART3SEL_FIELD(4U)
#define STM32_USART3SEL_LSE     STM32_USART3SEL_FIELD(5U)

#define STM32_UART4SEL_MASK     (7U << 9)
#define STM32_UART4SEL_FIELD(n) ((n) << 9)
#define STM32_UART4SEL_PCLK1    STM32_UART4SEL_FIELD(0U)
#define STM32_UART4SEL_PLL2Q    STM32_UART4SEL_FIELD(1U)
#define STM32_UART4SEL_PLL3Q    STM32_UART4SEL_FIELD(2U)
#define STM32_UART4SEL_HSI      STM32_UART4SEL_FIELD(3U)
#define STM32_UART4SEL_CSI      STM32_UART4SEL_FIELD(4U)
#define STM32_UART4SEL_LSE      STM32_UART4SEL_FIELD(5U)

#define STM32_UART5SEL_MASK     (7U << 12)
#define STM32_UART5SEL_FIELD(n) ((n) << 12)
#define STM32_UART5SEL_PCLK1    STM32_UART5SEL_FIELD(0U)
#define STM32_UART5SEL_PLL2Q    STM32_UART5SEL_FIELD(1U)
#define STM32_UART5SEL_PLL3Q    STM32_UART5SEL_FIELD(2U)
#define STM32_UART5SEL_HSI      STM32_UART5SEL_FIELD(3U)
#define STM32_UART5SEL_CSI      STM32_UART5SEL_FIELD(4U)
#define STM32_UART5SEL_LSE      STM32_UART5SEL_FIELD(5U)

#define STM32_USART6SEL_MASK    (7U << 15)
#define STM32_USART6SEL_FIELD(n) ((n) << 15)
#define STM32_USART6SEL_PCLK1   STM32_USART6SEL_FIELD(0U)
#define STM32_USART6SEL_PLL2Q   STM32_USART6SEL_FIELD(1U)
#define STM32_USART6SEL_PLL3Q   STM32_USART6SEL_FIELD(2U)
#define STM32_USART6SEL_HSI     STM32_USART6SEL_FIELD(3U)
#define STM32_USART6SEL_CSI     STM32_USART6SEL_FIELD(4U)
#define STM32_USART6SEL_LSE     STM32_USART6SEL_FIELD(5U)

#define STM32_UART7SEL_MASK     (7U << 18)
#define STM32_UART7SEL_FIELD(n) ((n) << 18)
#define STM32_UART7SEL_PCLK1    STM32_UART7SEL_FIELD(0U)
#define STM32_UART7SEL_PLL2Q    STM32_UART7SEL_FIELD(1U)
#define STM32_UART7SEL_PLL3Q    STM32_UART7SEL_FIELD(2U)
#define STM32_UART7SEL_HSI      STM32_UART7SEL_FIELD(3U)
#define STM32_UART7SEL_CSI      STM32_UART7SEL_FIELD(4U)
#define STM32_UART7SEL_LSE      STM32_UART7SEL_FIELD(5U)

#define STM32_UART8SEL_MASK     (7U << 21)
#define STM32_UART8SEL_FIELD(n) ((n) << 21)
#define STM32_UART8SEL_PCLK1    STM32_UART8SEL_FIELD(0U)
#define STM32_UART8SEL_PLL2Q    STM32_UART8SEL_FIELD(1U)
#define STM32_UART8SEL_PLL3Q    STM32_UART8SEL_FIELD(2U)
#define STM32_UART8SEL_HSI      STM32_UART8SEL_FIELD(3U)
#define STM32_UART8SEL_CSI      STM32_UART8SEL_FIELD(4U)
#define STM32_UART8SEL_LSE      STM32_UART8SEL_FIELD(5U)

#define STM32_UART9SEL_MASK     (7U << 24)
#define STM32_UART9SEL_FIELD(n) ((n) << 24)
#define STM32_UART9SEL_PCLK1    STM32_UART9SEL_FIELD(0U)
#define STM32_UART9SEL_PLL2Q    STM32_UART9SEL_FIELD(1U)
#define STM32_UART9SEL_PLL3Q    STM32_UART9SEL_FIELD(2U)
#define STM32_UART9SEL_HSI      STM32_UART9SEL_FIELD(3U)
#define STM32_UART9SEL_CSI      STM32_UART9SEL_FIELD(4U)
#define STM32_UART9SEL_LSE      STM32_UART9SEL_FIELD(5U)

#define STM32_USART10SEL_MASK   (7U << 27)
#define STM32_USART10SEL_FIELD(n) ((n) << 27)
#define STM32_USART10SEL_PCLK1  STM32_USART10SEL_FIELD(0U)
#define STM32_USART10SEL_PLL2Q  STM32_USART10SEL_FIELD(1U)
#define STM32_USART10SEL_PLL3Q  STM32_USART10SEL_FIELD(2U)
#define STM32_USART10SEL_HSI    STM32_USART10SEL_FIELD(3U)
#define STM32_USART10SEL_CSI    STM32_USART10SEL_FIELD(4U)
#define STM32_USART10SEL_LSE    STM32_USART10SEL_FIELD(5U)

#define STM32_TIMICSEL_NOCLK    0U
#define STM32_TIMICSEL_INTCLK   (1U << 31)
/** @} */

/**
 * @name    RCC_CCIPR2 register bits definitions
 * @{
 */
#define STM32_USART11SEL_MASK   (7U << 0)
#define STM32_USART11SEL_FIELD(n) ((n) << 0)
#define STM32_USART11SEL_PCLK1  STM32_USART11SEL_FIELD(0U)
#define STM32_USART11SEL_PLL2Q  STM32_USART11SEL_FIELD(1U)
#define STM32_USART11SEL_PLL3Q  STM32_USART11SEL_FIELD(2U)
#define STM32_USART11SEL_HSI    STM32_USART11SEL_FIELD(3U)
#define STM32_USART11SEL_CSI    STM32_USART11SEL_FIELD(4U)
#define STM32_USART11SEL_LSE    STM32_USART11SEL_FIELD(5U)

#define STM32_UART12SEL_MASK    (7U << 4)
#define STM32_UART12SEL_FIELD(n) ((n) << 4)
#define STM32_UART12SEL_PCLK1   STM32_UART12SEL_FIELD(0U)
#define STM32_UART12SEL_PLL2Q   STM32_UART12SEL_FIELD(1U)
#define STM32_UART12SEL_PLL3Q   STM32_UART12SEL_FIELD(2U)
#define STM32_UART12SEL_HSI     STM32_UART12SEL_FIELD(3U)
#define STM32_UART12SEL_CSI     STM32_UART12SEL_FIELD(4U)
#define STM32_UART12SEL_LSE     STM32_UART12SEL_FIELD(5U)

#define STM32_LPTIM1SEL_MASK    (7U << 8)
#define STM32_LPTIM1SEL_FIELD(n) ((n) << 8)
#define STM32_LPTIM1SEL_PCLK3   STM32_LPTIM1SEL_FIELD(0U)
#define STM32_LPTIM1SEL_PLL2P   STM32_LPTIM1SEL_FIELD(1U)
#define STM32_LPTIM1SEL_PLL3R   STM32_LPTIM1SEL_FIELD(2U)
#define STM32_LPTIM1SEL_LSE     STM32_LPTIM1SEL_FIELD(3U)
#define STM32_LPTIM1SEL_LSI     STM32_LPTIM1SEL_FIELD(4U)
#define STM32_LPTIM1SEL_PER     STM32_LPTIM1SEL_FIELD(5U)

#define STM32_LPTIM2SEL_MASK    (7U << 12)
#define STM32_LPTIM2SEL_FIELD(n) ((n) << 12)
#define STM32_LPTIM2SEL_PCLK1   STM32_LPTIM2SEL_FIELD(0U)
#define STM32_LPTIM2SEL_PLL2P   STM32_LPTIM2SEL_FIELD(1U)
#define STM32_LPTIM2SEL_PLL3R   STM32_LPTIM2SEL_FIELD(2U)
#define STM32_LPTIM2SEL_LSE     STM32_LPTIM2SEL_FIELD(3U)
#define STM32_LPTIM2SEL_LSI     STM32_LPTIM2SEL_FIELD(4U)
#define STM32_LPTIM2SEL_PER     STM32_LPTIM2SEL_FIELD(5U)

#define STM32_LPTIM3SEL_MASK    (7U << 16)
#define STM32_LPTIM3SEL_FIELD(n) ((n) << 16)
#define STM32_LPTIM3SEL_PCLK3   STM32_LPTIM3SEL_FIELD(0U)
#define STM32_LPTIM3SEL_PLL2P   STM32_LPTIM3SEL_FIELD(1U)
#define STM32_LPTIM3SEL_PLL3R   STM32_LPTIM3SEL_FIELD(2U)
#define STM32_LPTIM3SEL_LSE     STM32_LPTIM3SEL_FIELD(3U)
#define STM32_LPTIM3SEL_LSI     STM32_LPTIM3SEL_FIELD(4U)
#define STM32_LPTIM3SEL_PER     STM32_LPTIM3SEL_FIELD(5U)

#define STM32_LPTIM4SEL_MASK    (7U << 20)
#define STM32_LPTIM4SEL_FIELD(n) ((n) << 20)
#define STM32_LPTIM4SEL_PCLK3   STM32_LPTIM4SEL_FIELD(0U)
#define STM32_LPTIM4SEL_PLL2P   STM32_LPTIM4SEL_FIELD(1U)
#define STM32_LPTIM4SEL_PLL3R   STM32_LPTIM4SEL_FIELD(2U)
#define STM32_LPTIM4SEL_LSE     STM32_LPTIM4SEL_FIELD(3U)
#define STM32_LPTIM4SEL_LSI     STM32_LPTIM4SEL_FIELD(4U)
#define STM32_LPTIM4SEL_PER     STM32_LPTIM4SEL_FIELD(5U)

#define STM32_LPTIM5SEL_MASK    (7U << 24)
#define STM32_LPTIM5SEL_FIELD(n) ((n) << 24)
#define STM32_LPTIM5SEL_PCLK3   STM32_LPTIM5SEL_FIELD(0U)
#define STM32_LPTIM5SEL_PLL2P   STM32_LPTIM5SEL_FIELD(1U)
#define STM32_LPTIM5SEL_PLL3R   STM32_LPTIM5SEL_FIELD(2U)
#define STM32_LPTIM5SEL_LSE     STM32_LPTIM5SEL_FIELD(3U)
#define STM32_LPTIM5SEL_LSI     STM32_LPTIM5SEL_FIELD(4U)
#define STM32_LPTIM5SEL_PER     STM32_LPTIM5SEL_FIELD(5U)

#define STM32_LPTIM6SEL_MASK    (7U << 28)
#define STM32_LPTIM6SEL_FIELD(n) ((n) << 28)
#define STM32_LPTIM6SEL_PCLK3   STM32_LPTIM6SEL_FIELD(0U)
#define STM32_LPTIM6SEL_PLL2P   STM32_LPTIM6SEL_FIELD(1U)
#define STM32_LPTIM6SEL_PLL3R   STM32_LPTIM6SEL_FIELD(2U)
#define STM32_LPTIM6SEL_LSE     STM32_LPTIM6SEL_FIELD(3U)
#define STM32_LPTIM6SEL_LSI     STM32_LPTIM6SEL_FIELD(4U)
#define STM32_LPTIM6SEL_PER     STM32_LPTIM6SEL_FIELD(5U)
/** @} */

/**
 * @name    RCC_CCIPR3 register bits definitions
 * @{
 */
#define STM32_SPI1SEL_MASK      (7U << 0)
#define STM32_SPI1SEL_FIELD(n)  ((n) << 0)
#define STM32_SPI1SEL_PLL1Q     STM32_SPI1SEL_FIELD(0U)
#define STM32_SPI1SEL_PLL2P     STM32_SPI1SEL_FIELD(1U)
#define STM32_SPI1SEL_PLL3P     STM32_SPI1SEL_FIELD(2U)
#define STM32_SPI1SEL_AUDIOCLK  STM32_SPI1SEL_FIELD(3U)
#define STM32_SPI1SEL_PER       STM32_SPI1SEL_FIELD(4U)

#define STM32_SPI2SEL_MASK      (7U << 3)
#define STM32_SPI2SEL_FIELD(n)  ((n) << 3)
#define STM32_SPI2SEL_PLL1Q     STM32_SPI2SEL_FIELD(0U)
#define STM32_SPI2SEL_PLL2P     STM32_SPI2SEL_FIELD(1U)
#define STM32_SPI2SEL_PLL3P     STM32_SPI2SEL_FIELD(2U)
#define STM32_SPI2SEL_AUDIOCLK  STM32_SPI2SEL_FIELD(3U)
#define STM32_SPI2SEL_PER       STM32_SPI2SEL_FIELD(4U)

#define STM32_SPI3SEL_MASK      (7U << 6)
#define STM32_SPI3SEL_FIELD(n)  ((n) << 6)
#define STM32_SPI3SEL_PLL1Q     STM32_SPI3SEL_FIELD(0U)
#define STM32_SPI3SEL_PLL2P     STM32_SPI3SEL_FIELD(1U)
#define STM32_SPI3SEL_PLL3P     STM32_SPI3SEL_FIELD(2U)
#define STM32_SPI3SEL_AUDIOCLK  STM32_SPI3SEL_FIELD(3U)
#define STM32_SPI3SEL_PER       STM32_SPI3SEL_FIELD(4U)

#define STM32_SPI4SEL_MASK      (7U << 9)
#define STM32_SPI4SEL_FIELD(n)  ((n) << 9)
#define STM32_SPI4SEL_PCLK2     STM32_SPI4SEL_FIELD(0U)
#define STM32_SPI4SEL_PLL2P     STM32_SPI4SEL_FIELD(1U)
#define STM32_SPI4SEL_PLL3P     STM32_SPI4SEL_FIELD(2U)
#define STM32_SPI4SEL_HSI       STM32_SPI4SEL_FIELD(3U)
#define STM32_SPI4SEL_CSI       STM32_SPI4SEL_FIELD(4U)
#define STM32_SPI4SEL_HSE       STM32_SPI4SEL_FIELD(5U)

